src/cfe/Пропуск/Enums/пропуск_ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>пропуск_ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СозданиеПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщенияОбОшибке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаКонтролеруСведенийОСотруднике</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаДанныхПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаДанныхПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтролерОзнакомлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеКонтролера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеИдентификатораПропуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеТурникета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеТурникетаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение_СотрудникНеНайденПоИдентификаторуПропуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение_ТурникетОткрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение_ОшибкаОткрытияТурникета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение_СотрудникВТаблицеНеВыбран</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Пропуск/CommonModules/пропуск_ПодпискиНаСобытия/Ext/Module.bsl
Процедура пропуск_СправочникПользователиПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = пропуск_Логирование.ПустоеСообщение();
	Если Источник.ДополнительныеСвойства.Свойство("пропуск_ОбновлениеИдентификатораПропуска")
		И Источник.ДополнительныеСвойства.пропуск_ОбновлениеИдентификатораПропуска = Истина Тогда
		Сообщение.Текст = "Обновление идентификатора пропуска пользователя " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ОбновлениеИдентификатораПропуска;
	ИначеЕсли ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Сообщение.Текст = "Изменен пользователь " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.СозданиеПользователя;
	Иначе
		Сообщение.Текст = "Создан пользователь " + Источник;
		Сообщение.Тип = Перечисления.пропуск_ТипыСообщений.ИзменениеПользователя;
	КонецЕсли;
	
	Сообщение.Контекст = ОбъектВXML(Источник);
	
	пропуск_Логирование.ЗаписатьЛог(Сообщение);
	
КонецПроцедуры

Функция ОбъектВXML(Объект) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Объект);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
